//光伏发电实训及应用系统源代码
#include "stdio.h"
#include "windows.h" 
#include "time.h"
#include "string.h"
#include "stdlib.h"
#define PF printf
#define SF scanf
void system1()
{
	int a,i,num=0;
	char b,m[7],s[7]="return",Q1[4]="lyq";
	char x=1,y;
	//PF("%c",x);
	home: PF("\t\t    %c",x);
    PF("｛*  多功能光伏发电实训及应用系统   *｝%c\n\t 【背诵任务要求：（必须在五分钟内讲完，此处背诵用时2分46秒）】\n\t\n          制作者@：罗永庆\t\t\t\t    班级：258\a\n\n\t\t\t        若要开始请按数字键1:\n\t         \t\t\t",x);
    error: SF("%d%c",&a,&b);
    if(a==1)
    PF("\n\t\t\a     系统启动中……(请按回车键打开原文材料)：\n");
    else 
    { 
    	PF("\a\a输入有误，请输入数字 1 运行本程序，谢谢配合！\n");
    	goto error;
    }
    SF("%c",&b);
    if(b=='\n')
    	num1:PF("    \a（一）、光伏发电是解决广大农村地区能源问题的最佳选择。广大农村地区住房分散、");
    PF("电力传输距离远，如果家家户户使用光伏发电项目，不仅解决了电力输送问题");
    PF("同时也解决了农村能源、环境生态等一系列三农问题，是实现乡村振兴的重要项目。\n");
    SF("%c",&b);
    if(b=='\n')
   	 PF("    \a“多功能光伏发电实训及应用系统”集教学实训、实际应用、电路培训于一体。价格便宜，操作简单，适用于广大农业农村和学校推广使用，是一个具有多种用途的适用型创新项目\n");
   	 
    SF("%c",&b);
    if(b=='\n')
   		num2:  PF("    \a（二）、农村散住户群体很多，全国保守估计4000万户，若每户安装光伏发电应用装置，每台装置盈利500元，总收益可达200亿元.\n");
    SF("%c",&b);
    if(b=='\n')
    PF("   \a 中专学校，培训机构有开设电子电工，光伏发电项目的，都可以购买和安装该项目产品设备。若全国2万所学校购买和安装光伏发电实训装置，每所学校安装20套，每台装置盈利500元，总利润可达2亿元。\n");
    SF("%c",&b);
    if(b=='\n')
    PF("    \a我们的创业团队知识结构合理，团队中有电子商务专业1人，电子技术专业2人，计算机专业1人，团队成员均参加过创业培训，具有创业意识，拥有抓住市场机会的能力。\n");
    SF("%c",&b);
    if(b=='\n')
   		num3: PF("\a（三）、本产品由操作台体、光伏发电控制系统、照明电路安装系统等构成。\n");
    SF("%c",&b);
    if(b=='\n')
    	num4:PF("\a（四）、本产品特点：\n一、制作简单，成本较低。\n二、功能强大 \n可用于照明电路安装实训和教学。\n可用于光伏发电实训和教学系统\n可用于农村小型光伏发电系统\n");
    PF("三、占用空间较小，操作方便\n本产品采用独特的分层构造、设计合理、结构整凑\n");
    SF("%c",&b);
    if(b=='\n')
   		num5: PF("\a（五）、初期建设（2020-2024年） 设计和制作“多功能光伏发电及应用系统处理装置”\n\n   在老师的指导下，我们团队基本开发出“多功能光伏发电及应用系统处理装置”的初步雏形。\n    熟悉创业相关资料，积累创业项目相关技术、人脉关系、确认创业项目和初期规划。\n\n    取得家庭支持，整合资源、承租学校及小区多功能光伏发电实训及应用系统任务\n");
    SF("%c",&b);
    if(b=='\n')
    	num6:PF("\a（六）、我们的营销策略包括\n一、市场营销 二、产品营销 三、品牌战略\n");
    SF("%c",&b);
    if(b=='\n')
    	num7:PF("\a（七）、销售手段包括：\n一、媒体宣传 二、定向销售 三、政府推广 四、网络营销\n");
    SF("%c",&b);
    if(b=='\n')
    	num8:PF("\n\a（八）、这是我们2022年到2024的财务预算表\n");  
    SF("%c",&b);
    if(b=='\n')
    	num9:PF("\n\a（九）、习近平总书记说过“要打造生态宜居，文明富俗的美丽农村”，我们的项目就能够实现这个目标，谢谢各位专家老师！\n\n原文到此结束！\n\a\a\a\n\n");
    end: PF("————————————————\n若要返回首页请输入字符 return\n若要返回第一段请按数字键 1\n若要返回第二段请按数字键 2\n若要返回第三段请按数字键 3\n若要返回第四段请按数字键 4\n若要返回第五段请按数字键 5\n若要返回第六段请按数字键 6\n若要返回第七段请按数字键 7\n若要返回第八段请按数字键 8\n若要返回第九段请按数字键 9\n若要结束请按数字键 0\n输入英文lyq有惊喜哦!\n————————————————\n");
    gets_s(m);
    if(m[0]=='0')
    PF("\n\a\a\a\a本系统执行结束，谢谢使用！");
    else if(strcmp(m,s)==0) goto home;
    else if(m[0]=='1') goto num1;
    else if(m[0]=='2') goto num2;
    else if(m[0]=='3') goto num3;
    else if(m[0]=='4') goto num4;
    else if(m[0]=='5') goto num5;
    else if(m[0]=='6') goto num6;
    else if(m[0]=='7') goto num7;
    else if(m[0]=='8') goto num8;
    else if(m[0]=='9') goto num9;
    //else if(strcmp(m,Q1)==0) 
    else if(m[0]=='l')
	    {
	    	PF("\n恭喜你获得了 英雄李白%c， 皮肤敏锐之力！\n",x);
	    	PF("是否升级？（是请按1，不是请按0，想要开挂满级请按666）\n");
	    	SF("%d",&i);
	    	if(i==0)
	    	printf("恭喜你另外获得了 英雄鲁班七号  目前无皮肤！%c\n由于此时峽谷DOSS黑客世龙来袭，当前系统已进行自保状态！开始关闭中……",x);
	    	else if(i==666)
	    	{
	    		for(a=1;a<=120;a++)
	    		{
	    		printf("英雄等级+1\n",a);
	    		if(a==20){PF("恭喜你等级达到%d级 获得装备打野刀！\n",a); 	Sleep(500);	}
	    		else if(a==40){PF("恭喜你等级达到%d级 获得装备攻速鞋！\n",a);Sleep(500);	}
	    		else if(a==60){PF("恭喜你等级达到%d级 获得装备无尽之刃!\n",a);Sleep(500);	}
	    		else if(a==80){PF("恭喜你等级达到%d级 获得装备宗师之力!\n",a);	Sleep(500);}
	    		else if(a==100){PF("恭喜你等级达到%d级 获得装备破军！\n",a);Sleep(500);	}
	    		}
	    		PF("\a\a\a\a恭喜你达到等级满级%d!\n获得装备屠龙宝刀!吊打王者峡谷英雄无敌手,获得荣耀王者称号！%c\n到达人生巅峰！",a-1,x);
	    		
	    	
	    	}
	    	else if(i==1)
	    	{
	    		for(a=1;a<=120;a++)
	    		{
	    			SF("%c",&y);
	    			if(y=='\n')
	    			{
	    		  	  printf("等级+1，当前%d级。升级请按回车键！\n",a);
	    		      num++;
	    			}
	    		
	    		if(num==20)PF("  \t\t\t\t恭喜你等级达到%d级 获得装备打野刀！",a);
	    		else if(num==40)PF("  \t\t\t\t恭喜你等级达到%d级 获得装备攻速鞋！",a);
	    		else if(num==60)PF("  \t\t\t\t恭喜你等级达到%d级 获得装备无尽之刃!",a);
	    		else if(num==80)PF("  \t\t\t\t恭喜你等级达到%d级 获得装备宗师之力!",a);
	    		else if(num==100)PF("  \t\t\t\t恭喜你等级达到%d级 获得装备破军！",a);
	    		}
	    		PF("\a\a\a\a恭喜你达到等级满级%d!\n获得装备屠龙宝刀!吊打王者峡谷英雄无敌手,获得荣耀王者称号！%c\n到达人生巅峰！",a-1,x);
	    			
	    	}
   		 }
    else goto end;
}
